grevaillot/svd_tools/headers/STM32H753x/sai4.h
#pragma once 

/* --- SAI4: SAI ---------------------------------------------------- */

/** @defgroup sai4_registers SAI Register
@{*/

/** SAI4_SAI_GCR Global configuration register **/
#define SAI4_SAI_GCR			MMIO32(SAI4_BASE + 0x00)
/** SAI4_SAI_ACR1 Configuration register 1 **/
#define SAI4_SAI_ACR1			MMIO32(SAI4_BASE + 0x04)
/** SAI4_SAI_ACR2 Configuration register 2 **/
#define SAI4_SAI_ACR2			MMIO32(SAI4_BASE + 0x08)
/** SAI4_SAI_AFRCR This register has no meaning in AC97 and SPDIF audio protocol **/
#define SAI4_SAI_AFRCR			MMIO32(SAI4_BASE + 0x0c)
/** SAI4_SAI_ASLOTR This register has no meaning in AC97 and SPDIF audio protocol **/
#define SAI4_SAI_ASLOTR			MMIO32(SAI4_BASE + 0x10)
/** SAI4_SAI_AIM Interrupt mask register 2 **/
#define SAI4_SAI_AIM			MMIO32(SAI4_BASE + 0x14)
/** SAI4_SAI_ASR Status register **/
#define SAI4_SAI_ASR			MMIO32(SAI4_BASE + 0x18)
/** SAI4_SAI_ACLRFR Clear flag register **/
#define SAI4_SAI_ACLRFR			MMIO32(SAI4_BASE + 0x1c)
/** SAI4_SAI_ADR Data register **/
#define SAI4_SAI_ADR			MMIO32(SAI4_BASE + 0x20)
/** SAI4_SAI_BCR1 Configuration register 1 **/
#define SAI4_SAI_BCR1			MMIO32(SAI4_BASE + 0x24)
/** SAI4_SAI_BCR2 Configuration register 2 **/
#define SAI4_SAI_BCR2			MMIO32(SAI4_BASE + 0x28)
/** SAI4_SAI_BFRCR This register has no meaning in AC97 and SPDIF audio protocol **/
#define SAI4_SAI_BFRCR			MMIO32(SAI4_BASE + 0x2c)
/** SAI4_SAI_BSLOTR This register has no meaning in AC97 and SPDIF audio protocol **/
#define SAI4_SAI_BSLOTR			MMIO32(SAI4_BASE + 0x30)
/** SAI4_SAI_BIM Interrupt mask register 2 **/
#define SAI4_SAI_BIM			MMIO32(SAI4_BASE + 0x34)
/** SAI4_SAI_BSR Status register **/
#define SAI4_SAI_BSR			MMIO32(SAI4_BASE + 0x38)
/** SAI4_SAI_BCLRFR Clear flag register **/
#define SAI4_SAI_BCLRFR			MMIO32(SAI4_BASE + 0x3c)
/** SAI4_SAI_BDR Data register **/
#define SAI4_SAI_BDR			MMIO32(SAI4_BASE + 0x40)
/** SAI4_SAI_PDMCR PDM control register **/
#define SAI4_SAI_PDMCR			MMIO32(SAI4_BASE + 0x44)
/** SAI4_SAI_PDMDLY PDM delay register **/
#define SAI4_SAI_PDMDLY			MMIO32(SAI4_BASE + 0x48)

/**@}*/


/** @defgroup sai4_sai_gcr SAIGCR Global configuration register
@{*/


#define SAI4_SAI_GCR_SYNCOUT_SHIFT		4
#define SAI4_SAI_GCR_SYNCOUT_MASK		0x03
/** @defgroup sai4_sai_gcr_syncout SYNCOUT Synchronization outputs These bits are set and cleared by software.
@{*/
/**@}*/


#define SAI4_SAI_GCR_SYNCIN_SHIFT		0
#define SAI4_SAI_GCR_SYNCIN_MASK		0x03
/** @defgroup sai4_sai_gcr_syncin SYNCIN Synchronization inputs
@{*/
/**@}*/


/**@}*/

/** @defgroup sai4_sai_acr1 SAIACR1 Configuration register 1
@{*/

/** SAI4_SAI_ACR1_OSR Oversampling ratio for master clock **/
#define SAI4_SAI_ACR1_OSR		(1 << 26)

#define SAI4_SAI_ACR1_MCKDIV_SHIFT		20
#define SAI4_SAI_ACR1_MCKDIV_MASK		0x0f
/** @defgroup sai4_sai_acr1_mckdiv MCKDIV Master clock divider. These bits are set and cleared by software. These bits are meaningless when the audio block operates in slave mode. They have to be configured when the audio block is disabled. Others: the master clock frequency is calculated accordingly to the following formula:
@{*/
/**@}*/

/** SAI4_SAI_ACR1_NOMCK No divider **/
#define SAI4_SAI_ACR1_NOMCK		(1 << 19)
/** SAI4_SAI_ACR1_DMAEN DMA enable. This bit is set and cleared by software. Note: Since the audio block defaults to operate as a transmitter after reset, the MODE[1:0] bits must be configured before setting DMAEN to avoid a DMA request in receiver mode. **/
#define SAI4_SAI_ACR1_DMAEN		(1 << 17)
/** SAI4_SAI_ACR1_SAIXEN Audio block enable where x is A or B. This bit is set by software. To switch off the audio block, the application software must program this bit to 0 and poll the bit till it reads back 0, meaning that the block is completely disabled. Before setting this bit to 1, check that it is set to 0, otherwise the enable command will not be taken into account. This bit allows to control the state of SAIx audio block. If it is disabled when an audio frame transfer is ongoing, the ongoing transfer completes and the cell is fully disabled at the end of this audio frame transfer. Note: When SAIx block is configured in master mode, the clock must be present on the input of SAIx before setting SAIXEN bit. **/
#define SAI4_SAI_ACR1_SAIXEN		(1 << 16)
/** SAI4_SAI_ACR1_OUTDRIV Output drive. This bit is set and cleared by software. Note: This bit has to be set before enabling the audio block and after the audio block configuration. **/
#define SAI4_SAI_ACR1_OUTDRIV		(1 << 13)
/** SAI4_SAI_ACR1_MONO Mono mode. This bit is set and cleared by software. It is meaningful only when the number of slots is equal to 2. When the mono mode is selected, slot 0 data are duplicated on slot 1 when the audio block operates as a transmitter. In reception mode, the slot1 is discarded and only the data received from slot 0 are stored. Refer to Section: Mono/stereo mode for more details. **/
#define SAI4_SAI_ACR1_MONO		(1 << 12)

#define SAI4_SAI_ACR1_SYNCEN_SHIFT		10
#define SAI4_SAI_ACR1_SYNCEN_MASK		0x03
/** @defgroup sai4_sai_acr1_syncen SYNCEN Synchronization enable. These bits are set and cleared by software. They must be configured when the audio sub-block is disabled. Note: The audio sub-block should be configured as asynchronous when SPDIF mode is enabled.
@{*/
/**@}*/

/** SAI4_SAI_ACR1_CKSTR Clock strobing edge. This bit is set and cleared by software. It must be configured when the audio block is disabled. This bit has no meaning in SPDIF audio protocol. **/
#define SAI4_SAI_ACR1_CKSTR		(1 << 9)
/** SAI4_SAI_ACR1_LSBFIRST Least significant bit first. This bit is set and cleared by software. It must be configured when the audio block is disabled. This bit has no meaning in AC97 audio protocol since AC97 data are always transferred with the MSB first. This bit has no meaning in SPDIF audio protocol since in SPDIF data are always transferred with LSB first. **/
#define SAI4_SAI_ACR1_LSBFIRST		(1 << 8)

#define SAI4_SAI_ACR1_DS_SHIFT		5
#define SAI4_SAI_ACR1_DS_MASK		0x07
/** @defgroup sai4_sai_acr1_ds DS Data size. These bits are set and cleared by software. These bits are ignored when the SPDIF protocols are selected (bit PRTCFG[1:0]), because the frame and the data size are fixed in such case. When the companding mode is selected through COMP[1:0] bits, DS[1:0] are ignored since the data size is fixed to 8 bits by the algorithm. These bits must be configured when the audio block is disabled.
@{*/
/**@}*/


#define SAI4_SAI_ACR1_PRTCFG_SHIFT		2
#define SAI4_SAI_ACR1_PRTCFG_MASK		0x03
/** @defgroup sai4_sai_acr1_prtcfg PRTCFG Protocol configuration. These bits are set and cleared by software. These bits have to be configured when the audio block is disabled.
@{*/
/**@}*/


#define SAI4_SAI_ACR1_MODE_SHIFT		0
#define SAI4_SAI_ACR1_MODE_MASK		0x03
/** @defgroup sai4_sai_acr1_mode MODE SAIx audio block mode immediately
@{*/
/**@}*/


/**@}*/

/** @defgroup sai4_sai_acr2 SAIACR2 Configuration register 2
@{*/


#define SAI4_SAI_ACR2_COMP_SHIFT		14
#define SAI4_SAI_ACR2_COMP_MASK		0x03
/** @defgroup sai4_sai_acr2_comp COMP Companding mode. These bits are set and cleared by software. The -Law and the A-Law log are a part of the CCITT G.711 recommendation, the type of complement that will be used depends on CPL bit. The data expansion or data compression are determined by the state of bit MODE[0]. The data compression is applied if the audio block is configured as a transmitter. The data expansion is automatically applied when the audio block is configured as a receiver. Refer to Section: Companding mode for more details. Note: Companding mode is applicable only when TDM is selected.
@{*/
/**@}*/

/** SAI4_SAI_ACR2_CPL Complement bit. This bit is set and cleared by software. It defines the type of complement to be used for companding mode Note: This bit has effect only when the companding mode is -Law algorithm or A-Law algorithm. **/
#define SAI4_SAI_ACR2_CPL		(1 << 13)

#define SAI4_SAI_ACR2_MUTECNT_SHIFT		7
#define SAI4_SAI_ACR2_MUTECNT_MASK		0x3f
/** @defgroup sai4_sai_acr2_mutecnt MUTECNT Mute counter. These bits are set and cleared by software. They are used only in reception mode. The value set in these bits is compared to the number of consecutive mute frames detected in reception. When the number of mute frames is equal to this value, the flag MUTEDET will be set and an interrupt will be generated if bit MUTEDETIE is set. Refer to Section: Mute mode for more details.
@{*/
/**@}*/

/** SAI4_SAI_ACR2_MUTEVAL Mute value. This bit is set and cleared by software.It must be written before enabling the audio block: SAIXEN. This bit is meaningful only when the audio block operates as a transmitter, the number of slots is lower or equal to 2 and the MUTE bit is set. If more slots are declared, the bit value sent during the transmission in mute mode is equal to 0, whatever the value of MUTEVAL. if the number of slot is lower or equal to 2 and MUTEVAL = 1, the MUTE value transmitted for each slot is the one sent during the previous frame. Refer to Section: Mute mode for more details. Note: This bit is meaningless and should not be used for SPDIF audio blocks. **/
#define SAI4_SAI_ACR2_MUTEVAL		(1 << 6)
/** SAI4_SAI_ACR2_MUTE Mute. This bit is set and cleared by software. It is meaningful only when the audio block operates as a transmitter. The MUTE value is linked to value of MUTEVAL if the number of slots is lower or equal to 2, or equal to 0 if it is greater than 2. Refer to Section: Mute mode for more details. Note: This bit is meaningless and should not be used for SPDIF audio blocks. **/
#define SAI4_SAI_ACR2_MUTE		(1 << 5)
/** SAI4_SAI_ACR2_TRIS Tristate management on data line. This bit is set and cleared by software. It is meaningful only if the audio block is configured as a transmitter. This bit is not used when the audio block is configured in SPDIF mode. It should be configured when SAI is disabled. Refer to Section: Output data line management on an inactive slot for more details. **/
#define SAI4_SAI_ACR2_TRIS		(1 << 4)
/** SAI4_SAI_ACR2_FFLUSH FIFO flush. This bit is set by software. It is always read as 0. This bit should be configured when the SAI is disabled. **/
#define SAI4_SAI_ACR2_FFLUSH		(1 << 3)

#define SAI4_SAI_ACR2_FTH_SHIFT		0
#define SAI4_SAI_ACR2_FTH_MASK		0x07
/** @defgroup sai4_sai_acr2_fth FTH FIFO threshold. This bit is set and cleared by software.
@{*/
/**@}*/


/**@}*/

