grevaillot/svd_tools/headers/STM32H753x/sai4.h
/** SAI4_SAI_ASR_LFSDET Late frame synchronization detection. This bit is read only. This flag can be set only if the audio block is configured in slave mode. It is not used in AC97 or SPDIF mode. It can generate an interrupt if LFSDETIE bit is set in the SAI_xIM register. This flag is cleared when the software sets bit CLFSDET in SAI_xCLRFR register **/
#define SAI4_SAI_ASR_LFSDET		(1 << 6)
/** SAI4_SAI_ASR_AFSDET Anticipated frame synchronization detection. This bit is read only. This flag can be set only if the audio block is configured in slave mode. It is not used in AC97or SPDIF mode. It can generate an interrupt if AFSDETIE bit is set in SAI_xIM register. This flag is cleared when the software sets CAFSDET bit in SAI_xCLRFR register. **/
#define SAI4_SAI_ASR_AFSDET		(1 << 5)
/** SAI4_SAI_ASR_CNRDY Codec not ready. This bit is read only. This bit is used only when the AC97 audio protocol is selected in the SAI_xCR1 register and configured in receiver mode. It can generate an interrupt if CNRDYIE bit is set in SAI_xIM register. This flag is cleared when the software sets CCNRDY bit in SAI_xCLRFR register. **/
#define SAI4_SAI_ASR_CNRDY		(1 << 4)
/** SAI4_SAI_ASR_FREQ FIFO request. This bit is read only. The request depends on the audio block configuration: If the block is configured in transmission mode, the FIFO request is related to a write request operation in the SAI_xDR. If the block configured in reception, the FIFO request related to a read request operation from the SAI_xDR. This flag can generate an interrupt if FREQIE bit is set in SAI_xIM register. **/
#define SAI4_SAI_ASR_FREQ		(1 << 3)
/** SAI4_SAI_ASR_WCKCFG Wrong clock configuration flag. This bit is read only. This bit is used only when the audio block operates in master mode (MODE[1] = 0) and NODIV = 0. It can generate an interrupt if WCKCFGIE bit is set in SAI_xIM register. This flag is cleared when the software sets CWCKCFG bit in SAI_xCLRFR register. **/
#define SAI4_SAI_ASR_WCKCFG		(1 << 2)
/** SAI4_SAI_ASR_MUTEDET Mute detection. This bit is read only. This flag is set if consecutive 0 values are received in each slot of a given audio frame and for a consecutive number of audio frames (set in the MUTECNT bit in the SAI_xCR2 register). It can generate an interrupt if MUTEDETIE bit is set in SAI_xIM register. This flag is cleared when the software sets bit CMUTEDET in the SAI_xCLRFR register. **/
#define SAI4_SAI_ASR_MUTEDET		(1 << 1)
/** SAI4_SAI_ASR_OVRUDR Overrun / underrun. This bit is read only. The overrun and underrun conditions can occur only when the audio block is configured as a receiver and a transmitter, respectively. It can generate an interrupt if OVRUDRIE bit is set in SAI_xIM register. This flag is cleared when the software sets COVRUDR bit in SAI_xCLRFR register. **/
#define SAI4_SAI_ASR_OVRUDR		(1 << 0)

/**@}*/

/** @defgroup sai4_sai_aclrfr SAIACLRFR Clear flag register
@{*/

/** SAI4_SAI_ACLRFR_CLFSDET Clear late frame synchronization detection flag. This bit is write only. Programming this bit to 1 clears the LFSDET flag in the SAI_xSR register. This bit is not used in AC97or SPDIF mode Reading this bit always returns the value 0. **/
#define SAI4_SAI_ACLRFR_CLFSDET		(1 << 6)
/** SAI4_SAI_ACLRFR_CAFSDET Clear anticipated frame synchronization detection flag. This bit is write only. Programming this bit to 1 clears the AFSDET flag in the SAI_xSR register. It is not used in AC97or SPDIF mode. Reading this bit always returns the value 0. **/
#define SAI4_SAI_ACLRFR_CAFSDET		(1 << 5)
/** SAI4_SAI_ACLRFR_CCNRDY Clear Codec not ready flag. This bit is write only. Programming this bit to 1 clears the CNRDY flag in the SAI_xSR register. This bit is used only when the AC97 audio protocol is selected in the SAI_xCR1 register. Reading this bit always returns the value 0. **/
#define SAI4_SAI_ACLRFR_CCNRDY		(1 << 4)
/** SAI4_SAI_ACLRFR_CWCKCFG Clear wrong clock configuration flag. This bit is write only. Programming this bit to 1 clears the WCKCFG flag in the SAI_xSR register. This bit is used only when the audio block is set as master (MODE[1] = 0) and NODIV = 0 in the SAI_xCR1 register. Reading this bit always returns the value 0. **/
#define SAI4_SAI_ACLRFR_CWCKCFG		(1 << 2)
/** SAI4_SAI_ACLRFR_CMUTEDET Mute detection flag. This bit is write only. Programming this bit to 1 clears the MUTEDET flag in the SAI_xSR register. Reading this bit always returns the value 0. **/
#define SAI4_SAI_ACLRFR_CMUTEDET		(1 << 1)
/** SAI4_SAI_ACLRFR_COVRUDR Clear overrun / underrun. This bit is write only. Programming this bit to 1 clears the OVRUDR flag in the SAI_xSR register. Reading this bit always returns the value 0. **/
#define SAI4_SAI_ACLRFR_COVRUDR		(1 << 0)

/**@}*/

/** @defgroup sai4_sai_adr SAIADR Data register
@{*/


#define SAI4_SAI_ADR_DATA_SHIFT		0
#define SAI4_SAI_ADR_DATA_MASK		0xffffffff
/** @defgroup sai4_sai_adr_data DATA Data A write to this register loads the FIFO provided the FIFO is not full. A read from this register empties the FIFO if the FIFO is not empty.
@{*/
/**@}*/


/**@}*/

/** @defgroup sai4_sai_bcr1 SAIBCR1 Configuration register 1
@{*/

/** SAI4_SAI_BCR1_OSR Oversampling ratio for master clock **/
#define SAI4_SAI_BCR1_OSR		(1 << 26)

#define SAI4_SAI_BCR1_MCKDIV_SHIFT		20
#define SAI4_SAI_BCR1_MCKDIV_MASK		0x0f
/** @defgroup sai4_sai_bcr1_mckdiv MCKDIV Master clock divider. These bits are set and cleared by software. These bits are meaningless when the audio block operates in slave mode. They have to be configured when the audio block is disabled. Others: the master clock frequency is calculated accordingly to the following formula:
@{*/
/**@}*/

/** SAI4_SAI_BCR1_NOMCK No divider **/
#define SAI4_SAI_BCR1_NOMCK		(1 << 19)
/** SAI4_SAI_BCR1_DMAEN DMA enable. This bit is set and cleared by software. Note: Since the audio block defaults to operate as a transmitter after reset, the MODE[1:0] bits must be configured before setting DMAEN to avoid a DMA request in receiver mode. **/
#define SAI4_SAI_BCR1_DMAEN		(1 << 17)
/** SAI4_SAI_BCR1_SAIXEN Audio block enable where x is A or B. This bit is set by software. To switch off the audio block, the application software must program this bit to 0 and poll the bit till it reads back 0, meaning that the block is completely disabled. Before setting this bit to 1, check that it is set to 0, otherwise the enable command will not be taken into account. This bit allows to control the state of SAIx audio block. If it is disabled when an audio frame transfer is ongoing, the ongoing transfer completes and the cell is fully disabled at the end of this audio frame transfer. Note: When SAIx block is configured in master mode, the clock must be present on the input of SAIx before setting SAIXEN bit. **/
#define SAI4_SAI_BCR1_SAIXEN		(1 << 16)
/** SAI4_SAI_BCR1_OUTDRIV Output drive. This bit is set and cleared by software. Note: This bit has to be set before enabling the audio block and after the audio block configuration. **/
#define SAI4_SAI_BCR1_OUTDRIV		(1 << 13)
/** SAI4_SAI_BCR1_MONO Mono mode. This bit is set and cleared by software. It is meaningful only when the number of slots is equal to 2. When the mono mode is selected, slot 0 data are duplicated on slot 1 when the audio block operates as a transmitter. In reception mode, the slot1 is discarded and only the data received from slot 0 are stored. Refer to Section: Mono/stereo mode for more details. **/
#define SAI4_SAI_BCR1_MONO		(1 << 12)

#define SAI4_SAI_BCR1_SYNCEN_SHIFT		10
#define SAI4_SAI_BCR1_SYNCEN_MASK		0x03
/** @defgroup sai4_sai_bcr1_syncen SYNCEN Synchronization enable. These bits are set and cleared by software. They must be configured when the audio sub-block is disabled. Note: The audio sub-block should be configured as asynchronous when SPDIF mode is enabled.
@{*/
/**@}*/

