grevaillot/svd_tools/headers/STM32H753x/sai4.h
/** @defgroup sai4_sai_bdr SAIBDR Data register
@{*/


#define SAI4_SAI_BDR_DATA_SHIFT		0
#define SAI4_SAI_BDR_DATA_MASK		0xffffffff
/** @defgroup sai4_sai_bdr_data DATA Data A write to this register loads the FIFO provided the FIFO is not full. A read from this register empties the FIFO if the FIFO is not empty.
@{*/
/**@}*/


/**@}*/

/** @defgroup sai4_sai_pdmcr SAIPDMCR PDM control register
@{*/

/** SAI4_SAI_PDMCR_CKEN4 Clock enable of bitstream clock number 4 **/
#define SAI4_SAI_PDMCR_CKEN4		(1 << 11)
/** SAI4_SAI_PDMCR_CKEN3 Clock enable of bitstream clock number 3 **/
#define SAI4_SAI_PDMCR_CKEN3		(1 << 10)
/** SAI4_SAI_PDMCR_CKEN2 Clock enable of bitstream clock number 2 **/
#define SAI4_SAI_PDMCR_CKEN2		(1 << 9)
/** SAI4_SAI_PDMCR_CKEN1 Clock enable of bitstream clock number 1 **/
#define SAI4_SAI_PDMCR_CKEN1		(1 << 8)

#define SAI4_SAI_PDMCR_MICNBR_SHIFT		4
#define SAI4_SAI_PDMCR_MICNBR_MASK		0x03
/** @defgroup sai4_sai_pdmcr_micnbr MICNBR Number of microphones
@{*/
/**@}*/

/** SAI4_SAI_PDMCR_PDMEN PDM enable **/
#define SAI4_SAI_PDMCR_PDMEN		(1 << 0)

/**@}*/

/** @defgroup sai4_sai_pdmdly SAIPDMDLY PDM delay register
@{*/


#define SAI4_SAI_PDMDLY_DLYM4R_SHIFT		28
#define SAI4_SAI_PDMDLY_DLYM4R_MASK		0x07
/** @defgroup sai4_sai_pdmdly_dlym4r DLYM4R Delay line for second microphone of pair 4
@{*/
/**@}*/


#define SAI4_SAI_PDMDLY_DLYM4L_SHIFT		24
#define SAI4_SAI_PDMDLY_DLYM4L_MASK		0x07
/** @defgroup sai4_sai_pdmdly_dlym4l DLYM4L Delay line for first microphone of pair 4
@{*/
/**@}*/


#define SAI4_SAI_PDMDLY_DLYM3R_SHIFT		20
#define SAI4_SAI_PDMDLY_DLYM3R_MASK		0x07
/** @defgroup sai4_sai_pdmdly_dlym3r DLYM3R Delay line for second microphone of pair 3
@{*/
/**@}*/


#define SAI4_SAI_PDMDLY_DLYM3L_SHIFT		16
#define SAI4_SAI_PDMDLY_DLYM3L_MASK		0x07
/** @defgroup sai4_sai_pdmdly_dlym3l DLYM3L Delay line for first microphone of pair 3
@{*/
/**@}*/


#define SAI4_SAI_PDMDLY_DLYM2R_SHIFT		12
#define SAI4_SAI_PDMDLY_DLYM2R_MASK		0x07
/** @defgroup sai4_sai_pdmdly_dlym2r DLYM2R Delay line for second microphone of pair 2
@{*/
/**@}*/


#define SAI4_SAI_PDMDLY_DLYM2L_SHIFT		8
#define SAI4_SAI_PDMDLY_DLYM2L_MASK		0x07
/** @defgroup sai4_sai_pdmdly_dlym2l DLYM2L Delay line for first microphone of pair 2
@{*/
/**@}*/


#define SAI4_SAI_PDMDLY_DLYM1R_SHIFT		4
#define SAI4_SAI_PDMDLY_DLYM1R_MASK		0x07
/** @defgroup sai4_sai_pdmdly_dlym1r DLYM1R Delay line adjust for second microphone of pair 1
@{*/
/**@}*/


#define SAI4_SAI_PDMDLY_DLYM1L_SHIFT		0
#define SAI4_SAI_PDMDLY_DLYM1L_MASK		0x07
/** @defgroup sai4_sai_pdmdly_dlym1l DLYM1L Delay line adjust for first microphone of pair 1
@{*/
/**@}*/


/**@}*/
